## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/7994811557)



<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * github_actions_variable.gcp_terraform_executor_service_account_email
  * github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider
  * module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa["terraform_executor_pull_prod_plan"]
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.gcp_terraform_executor_service_account_email will be created
  + resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      + variable_name = "gcp_terraform_executor_service_account_email"
    }

  # github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be created
  + resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project-pool/providers/github-com-kyma-project-provider"
      + variable_name = "gh_com_kyma_project_gcp_workload_identity_federation_provider"
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa["terraform_executor_pull_prod_plan"] will be created
  + resource "google_service_account_iam_member" "wif-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project-pool/subject/repository_id:147495537:repository_owner_id:39153523:workflow:pull-plan-prod-terraform"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-02-21T19:12:13.539766Z" -> "2024-02-21T19:58:11.357617Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
  ~ service_account_keys_rotator                        = {
      ~ service_account_keys_rotator_service_account_iam = {
          ~ etag      = "BwYR6Oq8TyA=" -> "BwYR6cD+aTQ="
            id        = "sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            # (4 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
  ~ terraform_executor_gcp_prow_project_iam_member      = {
      ~ etag      = "BwYR6Oq8TyA=" -> "BwYR6cD+aTQ="
        id        = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (4 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_project_iam_member.terraform_executor_prow_project_owner has changed
  ~ resource "google_project_iam_member" "terraform_executor_prow_project_owner" {
      ~ etag    = "BwYR6Oq8TyA=" -> "BwYR6cD+aTQ="
        id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator has changed
  ~ resource "google_project_iam_member" "service_account_keys_rotator" {
      ~ etag    = "BwYR6Oq8TyA=" -> "BwYR6cD+aTQ="
        id      = "sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9936,"Program":"tfcmt","SHA1":"43ce7eb9ec663ebd5b7a258d7bb01190b7379a10","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->